# 4. 데이터프레임 합치기

In [1]:
import pandas as pd
df1 = pd.DataFrame({'a':['a0','a1','a2'],
                   'b':['b0','b1','b2'],
                   'c':['c0','c1','c2']},
                  index = [0,1,2])
df2 = pd.DataFrame({'a':['a1','a2','a3'],
                   'b':['b1','b2','b3'],
                   'c':['c1','c2','c3'],
                   'd':['d1','d2','d3']},
                   index=[1,2,3])
print(df1)
print()
print(df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2

    a   b   c   d
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [2]:
# 연결(concat)
result1 = pd.concat([df1,df2])
result1

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
1  a1  b1  c1   d1
2  a2  b2  c2   d2
3  a3  b3  c3   d3

In [3]:
result2 = pd.concat([df1,df2], ignore_index=True)
result2

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a1  b1  c1   d1
4  a2  b2  c2   d2
5  a3  b3  c3   d3

In [4]:
result3 = pd.concat([df1,df2], axis = 1)
result3

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1   a1   b1   c1   d1
2   a2   b2   c2   a2   b2   c2   d2
3  NaN  NaN  NaN   a3   b3   c3   d3

In [5]:
result3_in = pd.concat([df1,df2], axis = 1, join='inner')
result3_in

    a   b   c   a   b   c   d
1  a1  b1  c1  a1  b1  c1  d1
2  a2  b2  c2  a2  b2  c2  d2

In [6]:
# 병합(merge)
merge_inner = pd.merge(df1,df2) # df1과 df2의 공통 열인 a열,b,열,c열을 기준으로 병합 
# merge()함수 기본 값 : on=None, how=‘inner’

merge_inner

    a   b   c   d
0  a1  b1  c1  d1
1  a2  b2  c2  d2

In [7]:
merge_outer = pd.merge(df1,df2,how='outer',on='c') # how= 'outer': 기준이 되는 ‘c’열의 데이터가 한 쪽에만 속하더라도 포함
merge_outer

   a_x  b_x   c  a_y  b_y    d
0   a0   b0  c0  NaN  NaN  NaN
1   a1   b1  c1   a1   b1   d1
2   a2   b2  c2   a2   b2   d2
3  NaN  NaN  c3   a3   b3   d3

In [8]:
merge_left = pd.merge(df1, df2, how='left', on='c') # how=‘left’ 옵션 : 왼쪽 데이터프레임 키열에 속하는 데이터 값을 기준으로 병합
merge_left

  a_x b_x   c  a_y  b_y    d
0  a0  b0  c0  NaN  NaN  NaN
1  a1  b1  c1   a1   b1   d1
2  a2  b2  c2   a2   b2   d2

In [9]:
# 연결(join): 행 인덱스를 기준으로 결합
import pandas as pd
df1 = pd.DataFrame({'a':['a0','a1','a2'],
                   'b':['b0','b1','b2'],
                   'c':['c0','c1','c2']},
                  index = [0,1,2])
df2 = pd.DataFrame({'e':['e1','e2','e3'],
                   'f':['f1','f2','f3'],
                   'g':['g1','g2','g3'],
                   'h':['h1','h2','h3']},
                   index=[1,2,3])

df3 = df1.join(df2)
df3

    a   b   c    e    f    g    h
0  a0  b0  c0  NaN  NaN  NaN  NaN
1  a1  b1  c1   e1   f1   g1   h1
2  a2  b2  c2   e2   f2   g2   h2

# 5. 데이터프레임의 연산

In [10]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
print(df.head())
print()
print(type(df))
print()

addition = df + 10
print(addition.head())
print()
print(type(addition))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

<class 'pandas.core.frame.DataFrame'>

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

<class 'pandas.core.frame.DataFrame'>

In [11]:
substraction = addition - df
print(substraction.head())

    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0
3  10.0  10.0
4  10.0  10.0

In [12]:
# 그룹 객체 만들기
titanic_groupby = titanic.groupby('pclass').count()
titanic_groupby

,survived,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
pclass,,,,,,,,,,,,,,
1,216,216,186,216,216,216,214,216,216,216,175,214,216,216
2,184,184,173,184,184,184,184,184,184,184,16,184,184,184
3,491,491,355,491,491,491,491,491,491,491,12,491,491,491

In [22]:
titanic_groupby = titanic.groupby('pclass')[['sex','age']].count().style.background_gradient(cmap='Purples')
titanic_groupby

In [14]:
# 그룸 연산 메서드
titanic.groupby('pclass')['age'].agg([max,min])

         max   min
pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [15]:
agg_format = {"age":"max","sibsp":"sum","fare":"mean"}
titanic.groupby('pclass').agg(agg_format)

         age  sibsp       fare
pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

In [16]:
# group 객체.transform(매핑 함수)
def minusmean(x):
    return x - x.mean()

grouped = titanic.groupby(['pclass'])
age_minusmean = grouped.age.transform(minusmean)
print(age_minusmean.loc[0:4])

0   -3.140620
1   -0.233441
2    0.859380
3   -3.233441
4    9.859380
Name: age, dtype: float64